src/google-io-2009-tx-across-dc.org
#+title: Google I/O 2009 - Transactions Across Datacenters

#+BEGIN_EXPORT HTML
<iframe width="560" height="315" src="https://www.youtube.com/embed/srOgpXECblk" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
#+END_EXPORT

传说NASDAQ有两个DC，相距27miles，他们一直采用2PC提交来确保事务性。直到有一天他们发现网络延迟很高需要改进，所以找到专门的networking vendors. 工程师拿了5本笨重且巨大的手提箱去。networking vendors很好奇手提箱里面是什么，工程师说：“这里面装的是27miles的光纤。我们就用这么长的光纤做测试。如果延迟低于2ms，那么我们谈生意；如果高于2ms，那么我们就去找下一家。”
