html/google-io-2009-tx-across-dc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Google I/O 2009 - Transactions Across Datacenters</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">Google I/O 2009 - Transactions Across Datacenters</h1>
<div class="export">
<p>
&lt;iframe width="560" height="315" src="<a href="https://www.youtube.com/embed/srOgpXECblk">https://www.youtube.com/embed/srOgpXECblk</a>" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen&gt;&lt;/iframe&gt;
</p>

</div>

<p>
传说NASDAQ有两个DC，相距27miles，他们一直采用2PC提交来确保事务性。直到有一天他们发现网络延迟很高需要改进，所以找到专门的networking vendors. 工程师拿了5本笨重且巨大的手提箱去。networking vendors很好奇手提箱里面是什么，工程师说：“这里面装的是27miles的光纤。我们就用这么长的光纤做测试。如果延迟低于2ms，那么我们谈生意；如果高于2ms，那么我们就去找下一家。”
</p>
</div>
</body>
</html>
